InformationRegisters/СостоянияПлановыхКалькуляций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПлановыхКалькуляций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРасчетаПлановойКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Калькуляция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлановаяКалькуляция2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияПлановыхКалькуляций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	

// Записывает состояние калькуляции.
// Параметры:
//	Калькуляция - ДокументСсылка.ПлановаяКалькуляция2_2 - калькуляция по которой необходимо установить статус.
//	Состояние - ПеречислениеСсылка.СостоянияРасчетаПлановойКалькуляции - новое состояние.
//
Процедура УстановитьСостояние(Калькуляция, Состояние) Экспорт
	
	НаборЗаписей = РегистрыСведений.СостоянияПлановыхКалькуляций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Калькуляция.Установить(Калькуляция);
	
	Если ЗначениеЗаполнено(Состояние) Тогда
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Калькуляция = Калькуляция;
		НоваяЗапись.Состояние = Состояние;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы


#КонецОбласти

#КонецЕсли
